; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v2 - type_1 ?v6 - type_3)
 	      (pred_1 ?v3 - object ?v6 - type_3)
	      (pred_3 ?v2 - type_1 ?v4 - type_2)
	      (pred_2 ?v2 - type_1 ?v3 - object ?v4 - type_2))

   (:action op_1
       :parameters  (?v2 - type_1 ?v8 ?v7 - type_3)
       :precondition (and  (pred_4 ?v2 ?v8))
       :effect (and  (pred_4 ?v2 ?v7)
		     (not (pred_4 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_1 ?v1 - object ?v5 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v5) (pred_4 ?v2 ?v5) (pred_3 ?v2 ?v4))
       :effect (and (pred_2 ?v2 ?v1 ?v4)
		    (not (pred_1 ?v1 ?v5)) 
		    (not (pred_3 ?v2 ?v4))))

   (:action op_3
       :parameters (?v2 - type_1 ?v1 - object ?v5 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v1 ?v4) (pred_4 ?v2 ?v5))
       :effect (and (pred_1 ?v1 ?v5)
		    (pred_3 ?v2 ?v4)
		    (not (pred_2 ?v2 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_09 obj_06 - type_1
obj_01 obj_03 obj_05 obj_07 - type_2
obj_10 obj_08 obj_13 obj_11 - type_3
obj_02 obj_04 obj_12 obj_14 - object)
(:init
(pred_4 obj_09 obj_13)
(pred_3 obj_09 obj_01)
(pred_3 obj_09 obj_03)
(pred_4 obj_06 obj_10)
(pred_3 obj_06 obj_05)
(pred_3 obj_06 obj_07)
(pred_1 obj_02 obj_11)
(pred_1 obj_04 obj_11)
(pred_1 obj_12 obj_10)
(pred_1 obj_14 obj_08)
)
(:goal
(and
(pred_1 obj_02 obj_10)
(pred_1 obj_04 obj_08)
(pred_1 obj_12 obj_11)
(pred_1 obj_14 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_09 obj_11)))
)
)

; plan
1. (op_2 obj_06 obj_12 obj_10 obj_07)
   deleted: (pred_1 obj_12 obj_10) (pred_3 obj_06 obj_07)
   added: (pred_2 obj_06 obj_12 obj_07)
   goals met: 0 of 4
2. (op_1 obj_09 obj_13 obj_08)
   deleted: (pred_4 obj_09 obj_13)
   added: (pred_4 obj_09 obj_08)
   goals met: 0 of 4
3. (op_1 obj_06 obj_10 obj_11)
   deleted: (pred_4 obj_06 obj_10)
   added: (pred_4 obj_06 obj_11)
   goals met: 0 of 4
4. (op_2 obj_09 obj_14 obj_08 obj_03)
   deleted: (pred_1 obj_14 obj_08) (pred_3 obj_09 obj_03)
   added: (pred_2 obj_09 obj_14 obj_03)
   goals met: 0 of 4
5. (op_3 obj_06 obj_12 obj_11 obj_07)
   deleted: (pred_2 obj_06 obj_12 obj_07)
   added: (pred_1 obj_12 obj_11) (pred_3 obj_06 obj_07)
   goals met: 1 of 4
6. (op_1 obj_09 obj_08 obj_13)
   deleted: (pred_4 obj_09 obj_08)
   added: (pred_4 obj_09 obj_13)
   goals met: 1 of 4
7. (op_2 obj_06 obj_04 obj_11 obj_05)
   deleted: (pred_1 obj_04 obj_11) (pred_3 obj_06 obj_05)
   added: (pred_2 obj_06 obj_04 obj_05)
   goals met: 1 of 4
8. (op_3 obj_09 obj_14 obj_13 obj_03)
   deleted: (pred_2 obj_09 obj_14 obj_03)
   added: (pred_1 obj_14 obj_13) (pred_3 obj_09 obj_03)
   goals met: 2 of 4
9. (op_2 obj_06 obj_02 obj_11 obj_07)
   deleted: (pred_1 obj_02 obj_11) (pred_3 obj_06 obj_07)
   added: (pred_2 obj_06 obj_02 obj_07)
   goals met: 2 of 4
10. (op_1 obj_06 obj_11 obj_08)
   deleted: (pred_4 obj_06 obj_11)
   added: (pred_4 obj_06 obj_08)
   goals met: 2 of 4
11. (op_3 obj_06 obj_04 obj_08 obj_05)
   deleted: (pred_2 obj_06 obj_04 obj_05)
   added: (pred_1 obj_04 obj_08) (pred_3 obj_06 obj_05)
   goals met: 3 of 4
12. (op_1 obj_06 obj_08 obj_10)
   deleted: (pred_4 obj_06 obj_08)
   added: (pred_4 obj_06 obj_10)
   goals met: 3 of 4
13. (op_3 obj_06 obj_02 obj_10 obj_07)
   deleted: (pred_2 obj_06 obj_02 obj_07)
   added: (pred_1 obj_02 obj_10) (pred_3 obj_06 obj_07)
   goals met: 4 of 4
